{"course":[{"code":"ANTHRO 1","title":"PHYSICAL ANTHROPOLOGY","description":"Survey of the human fossil record, primate social behavior and comparative anatomy, genetics, and human diversity. The impact of human evolution on early and future global environments; issues surrounding future adaptation.","section":[{"sectionNumber":80,"day":[2,4],"room":"1564","instructor":"Benson"},{"sectionNumber":2721,"day":[2,4],"room":"4246","instructor":"Molino"}]},{"code":"CHEM 1A","title":"GENERAL CHEMISTRY","description":"General principles of chemistry including atomic theory, bonding, stoichiometry, kinetic-molecular theory, properties of mixtures, the periodic table, and thermodynamics. First semester of a one year program of general chemistry.","section":[{"sectionNumber":1298,"day":[1,3],"room":"1910","instructor":"Raola"},{"sectionNumber":284,"day":[2,4],"room":"1901","instructor":"Melbardis"}]},{"code":"CS 55.11","title":"JAVASCRIPT, JQUERY, AJAX","description":"JavaScript is a cross-platform, object-based scripting language. This course provides a solid foundation in JavaScript and shows students how to create scripts and incorporate them into webpages. Projects include writing Javascript and JQuery programs that manage dynamic content and webpage elements such as image slideshows; menus, tabs and panels; form controls and dialogues. Students will also create data-driven web elements using AJAX and API interfaces to web services such as maps and social media.","section":[{"sectionNumber":1516,"day":2,"room":"2923","instructor":"Peretz"}]},{"code":"CUL 253.5","title":"PROF MEAT & SAUCE PREP","description":"A practical course focusing on stocks, soups and sauces and the identification and fabrication of meats, poultry, fish and shellfish. Includes further development of the student's knife skills. Industry standards of sanitation and safety are implemented.","section":[{"sectionNumber":1530,"day":1,"room":"4923","instructor":"Cason"}]},{"code":"THAR 13.2","title":"SHAKESPEARE WORKSHOP","description":"Introduction to performing Shakespeare through an exploration of historical context, text analysis, acting theory, and performance techniques. Includes both in-depth monologue and scene work, resulting in a showcase performance open to the public.","section":[{"sectionNumber":2167,"day":[2,4],"room":"2167","instructor":"McCauley"}]}]}